andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_user_if.c
#ifdef ENABLE_QAC_TEST
    #pragma PRQA_MESSAGES_OFF 0292
#endif
/***********************************************************************************************************************
* Library       : Data Flash Access Library for Renesas RX111 devices, based on the MF3 Flash technology
*
* File Name     : $Source: r_fdl_user_if.c $
* Lib. Version  : $RX111_FDL_LIB_VERSION_T01: V1.01 $
* Mod. Revision : $Revision: 1.20 $
* Mod. Date     : $Date: 2013/09/03 09:50:52MESZ $
* Device(s)     : MF3 Flash based RX111 microcontroller
* Description   : FDL user interface functions
***********************************************************************************************************************/

/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only  intended for use with
* Renesas products. No other uses are authorized. This software is owned by Renesas Electronics
* Corporation and is protected under all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING THIS SOFTWARE,
* WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR
* ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR
* CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the
* availability of this software. By using this software, you agree to the additional terms and conditions
* found by accessing the  following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2012-2013 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

#ifdef ENABLE_QAC_TEST
    #pragma PRQA_MESSAGES_ON 0292
#endif

/***********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 3.1 (QAC message 0292)
* Reason:       To support automatic insertion of revision, module name etc. by the source
*               revision control system it is necessary to violate the rule, because the
*               system uses non basic characters as placeholders.
* Verification: The placeholders are used in commentars only. Therefore rule violation cannot
*               influency code compilation.
***********************************************************************************************************************/

/***********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 11.3 (QAC message 0306)
* Reason:       For effective embedded programming, integer to pointer conversions are used
* Verification: The converted addresses are essential for complete code execution. Incorrect
*               conversion would result in test fails.
***********************************************************************************************************************/

/***********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 14.1 (QAC message 1503)
* Reason:       This function is not used within the library, it is only used by the user
*               application.
* Verification: This function is part of the library API and therefore essential on the one hand.
*               On the other hand the QAC warning is correct, because this function is never
*               called within the library. To solve this dillemma it is neccessary and suitable
*               to disable the message.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "r_cg_macrodriver.h"
#include "r_fdl_env.h"
#include "r_fdl_types.h"
#include "r_fdl.h"
#include "r_fdl_global.h"
#include "fdl_cfg.h"

/***********************************************************************************************************************
 Compiler and device specific
***********************************************************************************************************************/
/**********************************************************************************************************************
* MISRA Rule:   QAC message 2022
* Reason:       This variable is used for the library management. Initialization will be  made separately in the 
*               function R_FDL_Init.
* Verification: Initialization is made separately in function R_FDL_Init, which should be called before any other 
*               library operation is started.  
**********************************************************************************************************************/
#if   FDL_COMPILER == FDL_COMP_GCC
    #include "rx111.h"
    r_fdl_data_t g_fdl_data_str __attribute__ ((section("R_FDL_DATA")));
#elif FDL_COMPILER == FDL_COMP_GHS
#elif FDL_COMPILER == FDL_COMP_IAR
    #include "iorx111.h"
    #pragma location = "R_FDL_DATA"
    r_fdl_data_t g_fdl_data_str;
#elif FDL_COMPILER == FDL_COMP_REC
    #include "rx111_iodefine_v050.h"
    #pragma section B R_FDL_DATA
    r_fdl_data_t g_fdl_data_str;                                                    /* PRQA S 2022 */
#endif

