andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_user_if.c
#if   FDL_COMPILER == FDL_COMP_GCC
#elif FDL_COMPILER == FDL_COMP_GHS
#elif FDL_COMPILER == FDL_COMP_IAR
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section B B
#endif

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
FDL_STATIC void           R_FDL_HandlerEraseSuspendProcessing (void) GCC_SECTION ("R_FDL_TEXT");
FDL_STATIC r_fdl_status_t R_FDL_HandlerEraseResumeProcessing  (void) GCC_SECTION ("R_FDL_TEXT");
FDL_STATIC r_fdl_status_t R_FDL_HandlerMultiOperation (void) GCC_SECTION ("R_FDL_TEXT");
FDL_STATIC r_fdl_status_t R_FDL_WriteOpStart (const r_fdl_request_t * request_pstr) GCC_SECTION ("R_FDL_TEXT");
FDL_STATIC r_fdl_status_t R_FDL_EraseOpStart (const r_fdl_request_t * request_pstr) GCC_SECTION ("R_FDL_TEXT");
FDL_STATIC r_fdl_status_t R_FDL_CheckOpStart (const r_fdl_request_t * request_pstr) GCC_SECTION ("R_FDL_TEXT");
FDL_STATIC void           R_FDL_EndCurrentOp (const r_fdl_status_t retVal_enu,
                                              const uint32_t failAdd_u32) GCC_SECTION ("R_FDL_TEXT");

/***********************************************************************************************************************
Compiler specific section defines
***********************************************************************************************************************/


/***********************************************************************************************************************
 * Function name: R_FDL_HandlerEraseSuspendProcessing
 **********************************************************************************************************************/
/**
 * Part of the R_FDL_Handler function.
 * This function suspends an ongoing Flash erase operation
 * If the FCB is still busy with the the erase operation, the FCB is stopped and the configuration
 * is backed up. If already finished, the operation result is backed up for later use on resume
 *
 * @return      void
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC void R_FDL_HandlerEraseSuspendProcessing (void)
{
    r_fdl_flag_t   rdy;
    r_fdl_status_t stat;
    uint32_t       add;

    /* Check if the FCB is not already ready. If yes backup the result, if no Reset the FCB */
    rdy = R_FDL_FCB_ChkReady ();

    if (R_FDL_TRUE == rdy)
    {
        /* Get operation status after operation end and reset the hardware status */
        stat = R_FDL_FCB_GetStat (&add);
        g_fdl_data_str.spdResStatus_enu  = stat;
        g_fdl_data_str.spdResAddress_u32 = add;
    }
    else
    {
        R_FDL_FCB_Reset ();
        g_fdl_data_str.spdResStatus_enu = R_FDL_BUSY;
    }

    /* Backup multi operation variables for resume */
    g_fdl_data_str.fdl_reqSuspend_pstr  = g_fdl_data_str.fdl_reqInt_pstr;
    g_fdl_data_str.spdMultiOp_str       = g_fdl_data_str.multiOp_str;

    g_fdl_data_str.spdSpdRequest_enu = R_FDL_FALSE;
    g_fdl_data_str.fdlIntStatus_enu  = R_FDL_ISTAT_INIT;
} /* R_FDL_HandlerEraseSuspendProcessing */


/***********************************************************************************************************************
 * Function name: R_FDL_HandlerEraseResumeProcessing
 **********************************************************************************************************************/
/**
 * Part of the R_FDL_Handler function.
 * This function resumes a suspended Flash operation if:
 * - resume request flag set (can only be set if a function was suspended)
 * - No Flash operation is ongoing
 *
 * @param[out]  tmpStat - Status return value. Is modified, if an operation is resumed.
 * @return      handler function flow may continue after this function or handler need to exit:
 * @li          R_FDL_BUSY - operation started
 * @li          R_FDL_ERR_PROTECTION - operation blocked due to wrong access
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC r_fdl_status_t R_FDL_HandlerEraseResumeProcessing (void)
{
    uint32_t           start_addr;
    r_fdl_accessType_t access_type;
    r_fdl_status_t     status = R_FDL_BUSY;

    status = R_FDL_FCB_SwitchMode (R_FDL_FCB_MODE_PE);
    if (R_FDL_OK == status)
    {
        /* Reset the resume request flag */
        g_fdl_data_str.spdResRequest_enu = R_FDL_FALSE;

        /* Restore variables for resume */
        g_fdl_data_str.fdl_reqInt_pstr = g_fdl_data_str.fdl_reqSuspend_pstr;
        g_fdl_data_str.fdl_reqSuspend_pstr = FDL_REQUEST_POINTER_UNDEFINED;

        /* Restore the multi operation data */
        start_addr                                  = (g_fdl_data_str.spdMultiOp_str).srcAdd_u32;
        access_type                                 = (g_fdl_data_str.spdMultiOp_str).accessType_enu;
        g_fdl_data_str.multiOp_str                  = g_fdl_data_str.spdMultiOp_str;

        /* Continue with busy state even if the FCB already finished operation on suspension.
           The ..._GetStat function will use the fcbStatBackup_enu instead FCB HW status */
        g_fdl_data_str.fdlIntStatus_enu              = R_FDL_ISTAT_BUSY;
        (g_fdl_data_str.fdl_reqInt_pstr)->status_enu = R_FDL_BUSY;
        g_fdl_data_str.fcbStatBackup_enu             = g_fdl_data_str.spdResStatus_enu;
        g_fdl_data_str.fcbAddBackup_u32              = g_fdl_data_str.spdResAddress_u32;
        
        /* Restart the block erase operation only if it was not finished at suspension time */
        if (R_FDL_BUSY == g_fdl_data_str.spdResStatus_enu)
        {
            start_addr -= FDL_BLOCK_SIZE;
        }
        else
        {
            (g_fdl_data_str.multiOp_str).srcAdd_u32 += FDL_BLOCK_SIZE;
        }
        
        if (start_addr < (g_fdl_data_str.multiOp_str).srcAddEnd_u32)
        {
            /* multi operation already forwarded the block pointer to the next block */
            status = R_FDL_FCB_StartFlashOperation (start_addr, ((start_addr + FDL_BLOCK_SIZE)  - 1),
                                                    FCB_REGPAT_FSSQ_CMD_ERS, access_type);
        }
    } /* end if (R_FDL_OK == status) */

    return (status);
} /* R_FDL_HandlerEraseResumeProcessing */


