andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_user_if.c
/***********************************************************************************************************************
 * Function name: R_FDL_HandlerMultiOperation
 **********************************************************************************************************************/
/**
 * Part of the R_FDL_Handler function.
 * In case of multi-operations (erase multiple blocks or write multiple bytes), after end
 * of a single Flash erase/write Flash operation, the next operation is started.
 *
 * @param[in, out]  tmpStat - current operation status. Used to judge previous operation result
 *                            and is updated in case of multi-operation requiring start of new
 *                            Flash operaiton
 * @return          handler function flow may continue after this function or handler need to exit:
 * @li              R_FDL_BUSY - operation started
 * @li              R_FDL_ERR_PROTECTION - operation blocked due to wrong access
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC r_fdl_status_t R_FDL_HandlerMultiOperation (void)
{
    r_fdl_status_t status = R_FDL_OK;

    /* Check if more data to erase/write:
       - erase or write operation
       - more data to erase/write */
    if ( (R_FDL_CMD_WRITE == (g_fdl_data_str.fdl_reqInt_pstr)->command_enu) ||
         (R_FDL_CMD_ERASE == (g_fdl_data_str.fdl_reqInt_pstr)->command_enu) )
    {
        if ( (g_fdl_data_str.multiOp_str).srcAdd_u32 <= (g_fdl_data_str.multiOp_str).srcAddEnd_u32 )
        {
            if (R_FDL_CMD_WRITE == (g_fdl_data_str.fdl_reqInt_pstr)->command_enu)
            {
                status = R_FDL_FCB_StartFlashOperation ( (g_fdl_data_str.multiOp_str).dstAdd_u32,
                                                         (g_fdl_data_str.multiOp_str).srcAdd_u32,
                                                         FCB_REGPAT_FSSQ_CMD_WRT,
                                                         (g_fdl_data_str.multiOp_str).accessType_enu );

                (g_fdl_data_str.multiOp_str).srcAdd_u32 += FDL_WRITE_SIZE;
                (g_fdl_data_str.multiOp_str).dstAdd_u32 += FDL_WRITE_SIZE;
            }
            else    /* Erase */
            {
                status = R_FDL_FCB_StartFlashOperation ((g_fdl_data_str.multiOp_str).srcAdd_u32,
                                                        ((g_fdl_data_str.multiOp_str).srcAdd_u32 + FDL_BLOCK_SIZE) - 1,
                                                        FCB_REGPAT_FSSQ_CMD_ERS,
                                                        (g_fdl_data_str.multiOp_str).accessType_enu );

                (g_fdl_data_str.multiOp_str).srcAdd_u32 += FDL_BLOCK_SIZE;
            }
        } /*end if ( (g_fdl_data_str.multiOp_str).srcAdd_u32 <= (g_fdl_data_str.multiOp_str).srcAddEnd_u32 ) */
    } /*end if ( (R_FDL_CMD_WRITE == (g_fdl_data_str.fdl_reqInt_pstr)->command_enu) ||
                 (R_FDL_CMD_ERASE == (g_fdl_data_str.fdl_reqInt_pstr)->command_enu) )  */

    return (status);
} /* R_FDL_HandlerMultiOperation */


/***********************************************************************************************************************
 * Function name: R_FDL_WriteOpStart
 **********************************************************************************************************************/
/**
 * Extract information required for the write operation, do parameter checks and call the function
 * which starts the write operation.
 *
 * @param[in]  request_pstr - pointer to the operation request structure
 *
 * @return     Parameter check result
 * @li         R_FDL_BUSY
 * @li         R_FDL_ERR_PARAMETER
 * @li         R_FDL_ERR_PROTECTION
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC r_fdl_status_t R_FDL_WriteOpStart (const r_fdl_request_t * request_pstr)
{
    r_fdl_status_t     status;
    r_fdl_accessType_t access_type;
    uint32_t           source_addr;
    uint32_t           dest_addr;
    uint32_t           byte_cnt;

    source_addr = request_pstr->dataAdd_u32;
    dest_addr   = request_pstr->idx_u32;
    byte_cnt    = (request_pstr->cnt_u16) * FDL_WRITE_SIZE;
    access_type = request_pstr->accessType_enu;

    /* Prepare for multi-byte write */
    (g_fdl_data_str.multiOp_str).srcAdd_u32     = source_addr + FDL_WRITE_SIZE;     /* Next Source Address */
    (g_fdl_data_str.multiOp_str).srcAddEnd_u32  = (source_addr + byte_cnt) - 1uL;   /* Source End Address  */
    (g_fdl_data_str.multiOp_str).dstAdd_u32     = dest_addr + FDL_WRITE_SIZE;       /* Next Dest. Address  */
    (g_fdl_data_str.multiOp_str).accessType_enu = request_pstr->accessType_enu;

    status = R_FDL_ChkAccessBoundaries (dest_addr, byte_cnt, access_type);
    if (R_FDL_BUSY == status)
    {
        status = R_FDL_FCB_SwitchMode (R_FDL_FCB_MODE_PE);
        if (R_FDL_OK == status)
        {
            status = R_FDL_FCB_StartFlashOperation (dest_addr, source_addr, FCB_REGPAT_FSSQ_CMD_WRT, access_type);
        }
    }

    return (status);
} /* R_FDL_WriteOpStart */


/***********************************************************************************************************************
 * Function name: R_FDL_EraseOpStart
 **********************************************************************************************************************/
/**
 * Extract information required for the Erase operation , do access parameter check
 * and call the function which starts the Erase operation.
 *
 * @param[in]  request_pstr - pointer to the operation request structure
 * @return     Parameter check result
 * @li         R_FDL_BUSY
 * @li         R_FDL_ERR_PARAMETER
 * @li         R_FDL_ERR_PROTECTION
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC r_fdl_status_t R_FDL_EraseOpStart (const r_fdl_request_t * request_pstr)
{
    r_fdl_status_t     status;
    r_fdl_accessType_t access_type;
    uint32_t           start_addr;
    uint32_t           byte_cnt;

    access_type = request_pstr->accessType_enu;
    start_addr  = ( (request_pstr->idx_u32) << FDL_BLOCK_SIZE_2N );
    byte_cnt    = ( (request_pstr->cnt_u16) << FDL_BLOCK_SIZE_2N );

