andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_user_if.c
    /* Prepare for multi-block erase */
    (g_fdl_data_str.multiOp_str).srcAdd_u32     = start_addr + FDL_BLOCK_SIZE;   /* Next Erase Address */
    (g_fdl_data_str.multiOp_str).srcAddEnd_u32  = (start_addr + byte_cnt) - 1uL; /* (multi-block)Erase End Address */
    (g_fdl_data_str.multiOp_str).accessType_enu = access_type;

    status = R_FDL_ChkAccessBoundaries (start_addr, byte_cnt, access_type);
    if (R_FDL_BUSY == status)
    {
        status = R_FDL_FCB_SwitchMode (R_FDL_FCB_MODE_PE);
        if (R_FDL_OK == status)
        {
            status = R_FDL_FCB_StartFlashOperation (start_addr, 
                                                    (start_addr + FDL_BLOCK_SIZE) - 1, 
                                                    FCB_REGPAT_FSSQ_CMD_ERS, 
                                                    access_type);
        }
    }

    return (status);
} /* R_FDL_EraseOpStart */


/***********************************************************************************************************************
 * Function name: R_FDL_CheckOpStart
 **********************************************************************************************************************/
/**
 * Extract information required for the BC operation , do access parameter check
 * and call the function which starts the BC operation.
 *
 * @param[in]  request_pstr - pointer to the operation request structure
 * @return     Parameter check result
 * @li         R_FDL_BUSY
 * @li         R_FDL_ERR_PARAMETER
 * @li         R_FDL_ERR_PROTECTION
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC r_fdl_status_t R_FDL_CheckOpStart (const r_fdl_request_t * request_pstr)
{
    r_fdl_status_t     status;
    r_fdl_accessType_t access_type;
    uint32_t           start_addr;
    uint32_t           end_addr;
    uint32_t           byte_cnt;
    uint16_t           fcu_cmd;

    access_type = request_pstr->accessType_enu;
    start_addr  = request_pstr->idx_u32;
    byte_cnt    = (request_pstr->cnt_u16) * FDL_WRITE_SIZE;
    end_addr    = (start_addr + byte_cnt) - 1uL;

    fcu_cmd = FCB_REGPAT_FSSQ_CMD_BC;

    status = R_FDL_ChkAccessBoundaries (start_addr, byte_cnt, access_type);
    if (R_FDL_BUSY == status)
    {
        status = R_FDL_FCB_SwitchMode (R_FDL_FCB_MODE_PE);
        if (R_FDL_OK == status)
        {
            status = R_FDL_FCB_StartFlashOperation (start_addr, end_addr, fcu_cmd, access_type);
        }
    }

    return (status);
} /* R_FDL_CheckOpStart */


/***********************************************************************************************************************
 * Function name: R_FDL_EndCurrentOp
 **********************************************************************************************************************/
/**
 * At the end of a requested operation, this function updates the request structure elements and
 * resets the library internal pointer to this structure.
 *
 * @param[in]  retVal_enu  - status return value
 *             failAdd_u32 - address where blankcheck command failed
 * @return     void
 *
 * The function modifies the global structure g_fdl_data_str.fdl_reqInt_pstr to set the operation
 * status
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC void R_FDL_EndCurrentOp (const r_fdl_status_t retVal_enu, const uint32_t failAdd_u32)
{
    (g_fdl_data_str.fdl_reqInt_pstr)->status_enu = retVal_enu;

    /* Reset the access type. In case of suspended, the access is reset at real operation end */
    if (R_FDL_SUSPENDED != retVal_enu)
    {
        (g_fdl_data_str.fdl_reqInt_pstr)->accessType_enu = R_FDL_ACCESS_NONE;
    }

    /* check operations need the operations fail address in case of operation fail */
    if (R_FDL_ERR_BLANKCHECK == retVal_enu)
    {
        (g_fdl_data_str.fdl_reqInt_pstr)->idx_u32 = failAdd_u32;
    }

    g_fdl_data_str.fdl_reqInt_pstr  = FDL_REQUEST_POINTER_UNDEFINED;
    g_fdl_data_str.fdlIntStatus_enu = R_FDL_ISTAT_INIT;

    (void)R_FDL_FCB_SwitchMode (R_FDL_FCB_MODE_USER);
} /* R_FDL_EndCurrentOp */


/***********************************************************************************************************************
        Public interface functions
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * Function name: R_FDL_Init
 **********************************************************************************************************************/
/**
 * User interface function:
 *
 * This function initializes the FDL. It must be called before any execution of a FDL function
 * with a properly set descriptor.
 *
 * In error case the library is set to not initialized (R_FDL_ISTAT_NOINIT)
 *
 * @param[in]  descriptor_pstr - Pointer to the FDL descriptor structure
 * @return     Initialization status when returned from function call:
 * @li         R_FDL_OK - Initialization was successful
 * @li         R_FDL_ERR_PARAMETER - FDL configuration parameter error or
 *                                   parameters are not properly set for speed operating mode
 * @li         R_FDL_ERR_PROTECTION - no data flash on the device or low speed operation mode
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
r_fdl_status_t R_FDL_Init (const r_fdl_descriptor_t * descriptor_pstr)              /* PRQA S 1503 */
{
    uint16_t fclk_freq;
    uint16_t df_size;
    uint16_t block_end;
    uint32_t i;
    uint32_t fdl_addr;

    /* Initially clear the complete fdl_data structure */
    fdl_addr = (uint32_t)(&g_fdl_data_str);                                         /* PRQA S 0306 */

    for (i = 0; i < sizeof (g_fdl_data_str); i++)
    {
        R_FDL_WriteMemoryU08 (fdl_addr, 0u);
        fdl_addr++;
    }

    g_fdl_data_str.fdlIntStatus_enu = R_FDL_ISTAT_NOINIT;

    /* Parameter independent initializations */
    g_fdl_data_str.fdl_reqSuspend_pstr = FDL_REQUEST_POINTER_UNDEFINED;
    g_fdl_data_str.fdl_reqInt_pstr     = FDL_REQUEST_POINTER_UNDEFINED;
    g_fdl_data_str.spdSpdRequest_enu   = R_FDL_FALSE;
    g_fdl_data_str.spdResRequest_enu   = R_FDL_FALSE;
    g_fdl_data_str.fcbStatBackup_enu   = R_FDL_BUSY;

    /* Reset debug patch */
    #ifdef PATCH_TO_SIMULATE_ERRORS
        g_fdl_data_str.simError_enu    = R_FDL_FALSE;
    #endif

    /* Initializations with parameter check */
    if (FDL_DESCRIPTOR_POINTER_UNDEFINED != descriptor_pstr)
    {
        /* Set pointer to FDL static configuration */
        g_fdl_data_str.RTCfg_pstr = descriptor_pstr;
    }
    else
    {
        return (R_FDL_ERR_PARAMETER);
    }

