andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_user_if.c
    /* find Data Flash size */
    df_size = DF_SIZE_BITS;                                                         /* PRQA S 0303 */
    if (0 != df_size)
    {
        /* 4, 8 or 16 KB are valid */
        df_size = (uint16_t)( 4 << (df_size - 1) );
    }
    else
    {
        return (R_FDL_ERR_PROTECTION);
    }

    /* check FDL pool not to exceed physically available Data Flash */
    if ( ( (g_fdl_data_str.RTCfg_pstr)->fdlPoolSize_u16 ) > df_size )
    {
        /* data flash size verification failed */
        return (R_FDL_ERR_PARAMETER);
    }

    /* Check EEL Flash window boundaries against Flash size */
    if (0u != (g_fdl_data_str.RTCfg_pstr)->fdlPoolSize_u16)
    {
        block_end = ( (g_fdl_data_str.RTCfg_pstr)->eelPoolStart_u16 ) +
                    ( (g_fdl_data_str.RTCfg_pstr)->eelPoolSize_u16 );

        if ( block_end >= ( (g_fdl_data_str.RTCfg_pstr)->fdlPoolSize_u16 + 1u ) )
        {
            return (R_FDL_ERR_PARAMETER);
        }
    }
    else
    {
        return (R_FDL_ERR_PARAMETER);
    }

    /* calculate FCK from given ICK */
    fclk_freq = (g_fdl_data_str.RTCfg_pstr)->fdlFrequencyCpuMHz_u16;
    fclk_freq <<= (PRESCALER_ICK);                                                  /* PRQA S 0303 */
    fclk_freq >>= (PRESCALER_FCK);                                                  /* PRQA S 0303 */
    if (0 != SYSTEM_MODE_LO)                                                        /* PRQA S 0303 */
    {
        /* FDL does not run in low speed power mode */
        return (R_FDL_ERR_PROTECTION);
    }
    else /* SYSTEM_MODE_LO = 0 */
    {
        /* medium of high speed power modes */
        if (fclk_freq >= FDL_FCBCLK_MIN_MHz)
        {
            if (SYSTEM_MODE_HIGH_SPEED == SYSTEM_MODE_MD_HI)                        /* PRQA S 0303 */
            {
                /* high speed */
                if (fclk_freq > FDL_FCBCLK_MAX_HIV_MHz)
                {
                    return (R_FDL_ERR_PARAMETER);
                }
            }
            else if (SYSTEM_MODE_MEDIUM_SPEED == SYSTEM_MODE_MD_HI)                 /* PRQA S 0303 */
            {
                /* medium speed */
                if (fclk_freq > FDL_FCBCLK_MAX_MDV_MHz)
                {
                    return (R_FDL_ERR_PARAMETER);
                }
            }
            else
            {
                /* operating mode bits (OPCM and SOPCM) are not set properly */
                return (R_FDL_ERR_PARAMETER);
            }
        } /* end if (fclk_freq >= FDL_FCBCLK_MIN_MHz) */
        else
        {
            return (R_FDL_ERR_PARAMETER);
        }
    } /* if (0 != SYSTEM_MODE_LO) - else */

    /* replace CPU freq with FCB frequency. CPU freq is not needed anymore */
    g_fdl_data_str.fcb_freq_Mhz = (uint8_t)fclk_freq;

    /* Reset the Flash environment for the case of EEPROM emulation after a "warm Reset" */
    R_FDL_FCB_Reset ();

    /* Set library init status  */
    g_fdl_data_str.fdlIntStatus_enu = R_FDL_ISTAT_INIT;

    return (R_FDL_OK);
} /* R_FDL_Init */


/***********************************************************************************************************************
 * Function name: R_FDL_Execute
 **********************************************************************************************************************/
/**
 * User interface function:
 * This function initiates a Flash operation (Erase/Write/...).
 * After initiation, the function R_FDL_Handler needs to be called regularely to finish the operation.
 *
 * @param[in, out] request_pstr   Pointer to the operation request structure.
 *                                - Structure input elements: \n
 *                                  command_enu, dataAdd_u32, idx_u32, cnt_u16, accessType_enu
 *                                - Structure output element: \n
 *                                  status_enu
 * @return      void
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
void  R_FDL_Execute (r_fdl_request_t * request_pstr)                           /* PRQA S 1503 */
{
    r_fdl_status_t fdl_req_status = R_FDL_ERR_REJECTED;

    /* New commands accepted if the library is idle and a suspended operation shall not be resumed */
    if ( (R_FDL_ISTAT_INIT == g_fdl_data_str.fdlIntStatus_enu) &&
         (R_FDL_FALSE      == g_fdl_data_str.spdResRequest_enu) )
    {
        /* Currently no operation ongoing */
        switch (request_pstr->command_enu)
        {
            case R_FDL_CMD_ERASE:
            {
                fdl_req_status = R_FDL_EraseOpStart (request_pstr);
                break;
            }

            case R_FDL_CMD_BLANKCHECK:
            {
                fdl_req_status = R_FDL_CheckOpStart (request_pstr);
                break;
            }

            case R_FDL_CMD_WRITE:
            {
                fdl_req_status = R_FDL_WriteOpStart (request_pstr);
                break;
            }

            default:
            {
                fdl_req_status = R_FDL_ERR_COMMAND;
                break;
            }
        } /* switch */

    } /* end if ( (R_FDL_ISTAT_INIT == g_fdl_data_str.fdlIntStatus_enu) &&
                  (R_FDL_FALSE      == g_fdl_data_str.spdResRequest_enu) )  */

    if (R_FDL_BUSY == fdl_req_status)
    {
        /* set internal pointer to the request structure, required by the handler */
        g_fdl_data_str.fdl_reqInt_pstr  = request_pstr;
        g_fdl_data_str.fdlIntStatus_enu = R_FDL_ISTAT_BUSY;
    }
    else
    {
        /* At operations end (In error case or if the operation requires no handler calls), reset
           the access type */
        request_pstr->accessType_enu = R_FDL_ACCESS_NONE;
    }

