andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_user_if.c
    /* Set the return state */
    request_pstr->status_enu = fdl_req_status;
} /* R_FDL_Execute */


/***********************************************************************************************************************
 * Function name: R_FDL_Handler
 **********************************************************************************************************************/
/**
 * User interface function:
 * This function forwards an initiated Flash operation until it is finished. At operation end the
 * result is set in the request structure.
 * After initiation by R_FDL_Execute, the function R_FDL_Handler need to be called regularly to finish
 * the operation.
 *
 * @param          void
 * @return         void
 *
 * The function returns the operation result in the status variable, passed to
 * the R_FDL_Execute variable (request.status_enu)
 */
/**********************************************************************************************************************/

/***********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 1.2 (QAC message 0505)
* Reason:       QAC claims referencing a possibly undefined pointer.
* Verification: Reviewed, that this is not possible. The pointer is always defined
***********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
void R_FDL_Handler (void)                                                      /* PRQA S 1503 */
{
    uint32_t       fail_addr = 0;
    r_fdl_flag_t   rdy;
    r_fdl_status_t stat = R_FDL_BUSY;

    /* Check if the handler has something to do */
    if ( (R_FDL_ISTAT_BUSY == g_fdl_data_str.fdlIntStatus_enu) ||
         ( (R_FDL_ISTAT_INIT == g_fdl_data_str.fdlIntStatus_enu) &&
           (R_FDL_TRUE == g_fdl_data_str.spdResRequest_enu) ) )
    {

        /* Suspend / Resume management */
        if (R_FDL_TRUE == g_fdl_data_str.spdSpdRequest_enu)
        {
            /* Erase operation is suspended ... now we are idle */
            R_FDL_HandlerEraseSuspendProcessing ();
            stat = R_FDL_SUSPENDED;
        }
        else if (R_FDL_TRUE == g_fdl_data_str.spdResRequest_enu)
        {
            /* Erase processing is resumed or FCB result backup is set */
            stat = R_FDL_HandlerEraseResumeProcessing ();
        }
        /* Normal operation */
        else
        {
            rdy = R_FDL_FCB_ChkReady ();
            if (R_FDL_TRUE == rdy)
            {
                stat = R_FDL_FCB_GetStat (&fail_addr);
                if (R_FDL_OK == stat)
                {
                    /* Multi operation (Write/Erase) state machine */
                    stat = R_FDL_HandlerMultiOperation ();
                }
            }
        }

        /* Normal operation end */
        if (R_FDL_BUSY != stat)
        {
            R_FDL_EndCurrentOp (stat, fail_addr);
        }
    } /* end check if handler has something to do */
#ifdef PATCH_TO_SIMULATE_ERRORS
    else
    {
        g_fdl_data_str.simErrorCnt_u32++;
    }
#endif

    
} /* R_FDL_Handler */


/***********************************************************************************************************************
 * Function name: R_FDL_EraseSuspendRequest
 **********************************************************************************************************************/
/**
 * User interface function:
 * Sets the suspend request flag for the an ongoing erase operation
 *
 * Note:
 * The operation is not immediately suspended. Suspend handling is controlled by R_FDL_Handler.
 *
 * Suspend request handling:
 * - Reject if
 *     - we have no active Flash erase operation
 *     - we have already a Flash operation suspended
 * - Reset resume request if set (then we have a not yet handled resume request)
 * - Set suspend request if we have an operation ongoing and we are not already in suspend
 *   processing
 *
 * @param      void
 * @return     result of the suspend request
 * @li         R_FDL_OK           - Request accepted
 * @li         R_FDL_ERR_REJECTED - Request rejected
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
r_fdl_status_t R_FDL_EraseSuspendRequest (void)                                /* PRQA S 1503 */
{
    r_fdl_status_t status = R_FDL_ERR_REJECTED;

    /* library internal state "resume request" (idle & resume request set) */
    if ( (R_FDL_ISTAT_INIT == g_fdl_data_str.fdlIntStatus_enu) &&
         (R_FDL_TRUE       == g_fdl_data_str.spdResRequest_enu) )
    {
        g_fdl_data_str.spdResRequest_enu = R_FDL_FALSE;
        status = R_FDL_OK;
    }
    else
    {
        /* library internal state "busy" (busy & no suspended erase operation) */
        if ( (R_FDL_ISTAT_BUSY              == g_fdl_data_str.fdlIntStatus_enu)    &&
             (FDL_REQUEST_POINTER_UNDEFINED == g_fdl_data_str.fdl_reqSuspend_pstr) && 
             (R_FDL_TRUE != g_fdl_data_str.spdSpdRequest_enu)                         )
        {
            if (R_FDL_CMD_ERASE == (g_fdl_data_str.fdl_reqInt_pstr)->command_enu)
            {
                g_fdl_data_str.spdSpdRequest_enu = R_FDL_TRUE;
                status = R_FDL_OK;
            }
        }
    }

    return (status);
} /* R_FDL_EraseSuspendRequest */


/***********************************************************************************************************************
 * Function name: R_FDL_EraseResumeRequest
 **********************************************************************************************************************/
/**
 * User interface function:
 * Sets the resume request flag on a suspended erase operation
 *
 * Note:
 * The operation is not immediately resumed. Resume handling is controlled by R_FDL_Handler.
 *
 * Resume request handling:
 * - Reset suspend request if set (then we have a not yet handled suspend request)
 * - Set resume request if we have a suspended operation ( fdl_reqSuspend_pstr defined )
 *   and we have not already a resume request
 * - Reject all other conditions
 *
 * @param      void
 * @return     result of the resume request
 * @li         R_FDL_OK           - Request accepted
 * @li         R_FDL_ERR_REJECTED - Request rejected
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
r_fdl_status_t R_FDL_EraseResumeRequest (void)                                 /* PRQA S 1503 */
{
    r_fdl_status_t status = R_FDL_ERR_REJECTED;

    /* library internal state "suspend request" (busy & suspend request set) */
    if ( (R_FDL_ISTAT_BUSY == g_fdl_data_str.fdlIntStatus_enu) &&
         (R_FDL_TRUE       == g_fdl_data_str.spdSpdRequest_enu) )
    {
        g_fdl_data_str.spdSpdRequest_enu = R_FDL_FALSE;
        status = R_FDL_OK;
    }
    else
    {
        /* library internal state "erase suspended" (idle & suspendedn & no resume request set) */
        if ( (R_FDL_ISTAT_INIT == g_fdl_data_str.fdlIntStatus_enu) &&
             ( (FDL_REQUEST_POINTER_UNDEFINED != g_fdl_data_str.fdl_reqSuspend_pstr) &&
               (R_FDL_FALSE                   == g_fdl_data_str.spdResRequest_enu) ) )
        {
            g_fdl_data_str.spdResRequest_enu = R_FDL_TRUE;
            status = R_FDL_OK;
        }
    }

    return (status);
} /* R_FDL_EraseResumeRequest */


