andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_user_if.c
/***********************************************************************************************************************
 * Function name: R_FDL_StandBy
 **********************************************************************************************************************/
/**
 * User interface function:
 * Prepares the HW for fast standby entry:
 * - on erase --> stop operation and backup FCB configuration for later restart on R_FDL_WakeUp
 * - other operations are not suspendable, here the function need to be called until the FCB
 *   finished the operation
 *
 * This function can be called asynchronous (e.g. interrupt function) and so need to take
 * care of the current hardware status in order to restore it later on during wakeup
 *
 * Note:
 * the function need to be called continuously until the result is != R_FDL_BUSY
 *
 * @param      void
 * @return     result of the standby operation
 * @li         R_FDL_OK           - Flash hardware is in standby or ready (no more Flash operation)
 * @li         R_FDL_BUSY         - Flash hardware is still busy. Continue by calling the R_FDL_Handler function
 * @li         R_FDL_ERR_REJECTED - Rejected, as the library is not initialized
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
r_fdl_status_t R_FDL_StandBy (void)                                            /* PRQA S 1503 */
{
    r_fdl_status_t status;
    r_fdl_flag_t   rdy;

    if (R_FDL_ISTAT_INIT == g_fdl_data_str.fdlIntStatus_enu)
    {
        g_fdl_data_str.stdByIntStatus_enu = g_fdl_data_str.fdlIntStatus_enu;
        g_fdl_data_str.fdlIntStatus_enu   = R_FDL_ISTAT_STANDBY;
        status = R_FDL_OK;
    }
    else
    {
        if (R_FDL_ISTAT_BUSY == g_fdl_data_str.fdlIntStatus_enu)
        {
            /* Set to standby processing */
            g_fdl_data_str.stdByIntStatus_enu = g_fdl_data_str.fdlIntStatus_enu;
            g_fdl_data_str.fdlIntStatus_enu   = R_FDL_ISTAT_STANDBYPROC;
        }

        if (R_FDL_ISTAT_STANDBYPROC == g_fdl_data_str.fdlIntStatus_enu)
        {
            g_fdl_data_str.stdByEraseStopped_enu = R_FDL_FALSE;
            status = R_FDL_BUSY;

            /* stop an ongoing erase and wait for end of any other operation */
            rdy = R_FDL_FCB_ChkReady ();
            if (R_FDL_FALSE == rdy)
            {
                /* hardware is still busy and does an erase */
                if (R_FDL_CMD_ERASE == (g_fdl_data_str.fdl_reqInt_pstr)->command_enu)
                {
                    g_fdl_data_str.stdByEraseAdd_u32  = R_FDL_FCB_GetOPAdd ();
                    g_fdl_data_str.stdByEraseAdd_u32 -= FDL_DF_BASE_ADD;
                    g_fdl_data_str.stdByEraseStopped_enu = R_FDL_TRUE;

                    R_FDL_FCB_Reset ();
                    (void)R_FDL_FCB_SwitchMode (R_FDL_FCB_MODE_USER);

                    g_fdl_data_str.fdlIntStatus_enu = R_FDL_ISTAT_STANDBY;
                    status = R_FDL_OK;
                }
            } /* end if (R_FDL_FALSE == rdy) */
            else
            {
                (void)R_FDL_FCB_SwitchMode (R_FDL_FCB_MODE_USER);
                g_fdl_data_str.fdlIntStatus_enu = R_FDL_ISTAT_STANDBY;
                status = R_FDL_OK;
            }
            
            #ifdef PATCH_TO_SIMULATE_ERRORS
                g_fdl_data_str.sequencerReady_enu = rdy;
            #endif
        } /* end if (R_FDL_ISTAT_STANDBYPROC == g_fdl_data_str.fdlIntStatus_enu) */
        else
        {
            /* internal status is not initialized */
            status = R_FDL_ERR_REJECTED;
        }
    } /* if (R_FDL_ISTAT_INIT == g_fdl_data_str.fdlIntStatus_enu) - else */

    return (status);
} /* R_FDL_StandBy */


/***********************************************************************************************************************
 * Function name: R_FDL_WakeUp
 **********************************************************************************************************************/
/**
 * User interface function:
 * Wake up the hardware from standby.
 * Depending on the FCB status on standby:
 * - Stopped Erase operation is restarted
 * - On finished write/blankcheck operation just return to programming mode
 * - On no operation ongoing... do nothing
 *
 * @param      void
 * @return     result of the initialization check
 * @li         R_FDL_OK           - Wakeup succeeded
 * @li         R_FDL_ERR_REJECTED - Rejected, as the library is not initialized
 * @li         R_FDL_ERR_PROTECTION - Protection error on erase restart
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
r_fdl_status_t R_FDL_WakeUp (void)                                             /* PRQA S 1503 */
{
    r_fdl_status_t status;
    uint32_t       erase_addr;

    /* We can only wakeup if we have been in standby before */
    if (R_FDL_ISTAT_STANDBY == g_fdl_data_str.fdlIntStatus_enu)
    {
        status = R_FDL_OK;
        g_fdl_data_str.fdlIntStatus_enu = g_fdl_data_str.stdByIntStatus_enu;

        /* If we were in PE mode @ standby, we need to return to that mode at first */
        if (R_FDL_ISTAT_BUSY == g_fdl_data_str.stdByIntStatus_enu)
        {
            status = R_FDL_FCB_SwitchMode (R_FDL_FCB_MODE_PE);
        }

        if (R_FDL_OK == status)
        {
            /* If we had a not finished erase @ standby, we will restart it */
            if (R_FDL_TRUE == g_fdl_data_str.stdByEraseStopped_enu)
            {
                erase_addr = g_fdl_data_str.stdByEraseAdd_u32;
                status = R_FDL_FCB_StartFlashOperation ( erase_addr, 
                                                         ((erase_addr + FDL_BLOCK_SIZE) - 1), 
                                                         FCB_REGPAT_FSSQ_CMD_ERS,
                                                         (g_fdl_data_str.fdl_reqInt_pstr)->accessType_enu );
                if (R_FDL_BUSY == status) /* Patch return value to function result OK */
                {
                    status = R_FDL_OK;
                }
            }
        }
    } /* end if (R_FDL_ISTAT_STANDBY == g_fdl_data_str.fdlIntStatus_enu) */
    else
    {
        status = R_FDL_ERR_REJECTED;
    }

    return (status);
} /* R_FDL_WakeUp */


/***********************************************************************************************************************
 * Function name: R_FDL_GetVersionString
 **********************************************************************************************************************/
/**
 * User interface function:
 * Returns the pointer to the library version string, stores in the library code section.
 *
 * @param      void
 * @return     pointer to the version string in Flash
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
    #pragma section C R_FDL_CONST
#endif
const uint8_t *R_FDL_GetVersionString (void)                                  /* PRQA S 1503 */
{
    #if FDL_COMPILER == FDL_COMP_GCC
        static const uint8_t fdl_ver_str[] GCC_SECTION ("R_FDL_CONST") = R_FDL_LIBRARY_VERSION;

    #elif FDL_COMPILER == FDL_COMP_IAR
        static const uint8_t fdl_ver_str[] @ "R_FDL_CONST" = R_FDL_LIBRARY_VERSION;

    #elif FDL_COMPILER == FDL_COMP_REC
        static const uint8_t fdl_ver_str[] = R_FDL_LIBRARY_VERSION;

    #endif

    return (&fdl_ver_str[0]);
}

